buildingLes/buildingLes/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)  	//0
    (0 3 0)  	//1
    (0 4 0)  	//2
    (0 7 0)     //3

    (4 0 0) 	//4
    (4 3 0)  	//5
    (4 4 0)  	//6
    (4 7 0)  	//7

    (5 0 0)  	//8
    (5 3 0)  	//9
    (5 4 0)  	//10
    (5 7 0)     //11

    (12 0 0) 	//12
    (12 3 0)  	//13
    (12 4 0)  	//14
    (12 7 0)  	//15


    (0 0 1)  	//16
    (0 3 1)  	//17
    (0 4 1)  	//18
    (0 7 1)     //19

    (4 0 1) 	//20
    (4 3 1)  	//21
    (4 4 1)  	//22
    (4 7 1)  	//23

    (5 0 1)  	//24
    (5 3 1)  	//25
    (5 4 1)  	//26
    (5 7 1)     //27

    (12 0 1) 	//28
    (12 3 1)  	//29
    (12 4 1)  	//30
    (12 7 1)  	//31

    (0 0 5)  	//32
    (0 3 5)  	//33
    (0 4 5)  	//34
    (0 7 5)     //35

    (4 0 5) 	//36
    (4 3 5)  	//37
    (4 4 5)  	//38
    (4 7 5)  	//39

    (5 0 5)  	//40
    (5 3 5)  	//41
    (5 4 5)  	//42
    (5 7 5)     //43

    (12 0 5) 	//28
    (12 3 5)  	//29
    (12 4 5)  	//30
    (12 7 5)  	//31

);

blocks
(
    hex (0 4 5 1 16 20 21 17) (40 30 10) simpleGrading (1 1 1)

    hex (1 5 6 2 17 21 22 18) (40 10 10) simpleGrading (1 1 1)

    hex (2 6 7 3 18 22 23 19) (40 30 10) simpleGrading (1 1 1)

    hex (4 8 9 5 20 24 25 21) (10 30 10) simpleGrading (1 1 1)

    hex (6 10 11 7 22 26 27 23) (10 30 10) simpleGrading (1 1 1)

    hex (8 12 13 9 24 28 29 25) (70 30 10) simpleGrading (1 1 1)

    hex (9 13 14 10 25 29 30 26) (70 10 10) simpleGrading (1 1 1)

    hex (10 14 15 11 26 30 31 27) (70 30 10) simpleGrading (1 1 1)

    hex (16 20 21 17 32 36 37 33) (40 30 40) simpleGrading (1 1 1)

    hex (17 21 22 18 33 37 38 34) (40 10 40) simpleGrading (1 1 1)

    hex (18 22 23 19 34 38 39 35) (40 30 40) simpleGrading (1 1 1)

    hex (20 24 25 21 36 40 41 37) (10 30 40) simpleGrading (1 1 1)

    hex (21 25 26 22 37 41 42 38) (10 10 40) simpleGrading (1 1 1)

    hex (22 26 27 23 38 42 43 39) (10 30 40) simpleGrading (1 1 1)

    hex (24 28 29 25 40 44 45 41) (70 30 40) simpleGrading (1 1 1)

    hex (25 29 30 26 41 45 46 42) (70 10 40) simpleGrading (1 1 1)

    hex (26 30 31 27 42 46 47 43) (70 30 40) simpleGrading (1 1 1)


);

edges
(
);

boundary
(
    Wall
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (4 8 9 5)
            (6 10 11 7)
            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)

            (5 6 22 21)
            (5 9 25 21)
            (9 10 26 25)
            (6 10 26 22)
            (21 22 26 25)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (32 36 37 33)
            (33 37 38 34)
            (34 38 39 35)
            (36 40 41 37)
            (37 41 42 38)
            (38 42 43 39)
            (40 44 45 41)
            (41 45 46 42)
            (42 46 47 43)
        );
    }
         
    front
    {
        type symmetryPlane;
        faces
        (
            (0 4 20 16)
            (16 20 36 32)
            (4 8 24 20)
            (20 24 40 36)
            (8 12 28 24)
            (24 28 44 40)
        );
    }

    back
    {
        type symmetryPlane;
        faces
        (
            (3 7 23 19)
            (19 23 39 35)
            (7 11 27 23)
            (23 27 43 39)
            (11 15 31 27)
            (27 31 47 43)
        );
    }
    
    inlet
    {
        type patch;
        faces
        (
            (0 1 17 16)
            (16 17 33 32)
            (1 2 18 17)
            (17 18 34 33)
            (2 3 19 18)
            (18 19 35 34)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (12 13 29 28)
            (28 29 45 44)
            (13 14 30 29)
            (29 30 46 45)
            (14 15 31 30)
            (30 31 47 46)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
