buildingLes/buildingLes/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         50;

deltaT          0.25e-1;

writeControl    timeStep;

writeInterval   40;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;
InfoSwitches
{
    writePrecision  6;
    writeJobInfo    0;
    // Allow case-supplied C++ code (#codeStream, codedFixedValue)
    allowSystemOperations   1;
}
functions
{
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   1;

        fields
        (
          U  p
        );

        probeLocations
        (
	(4 3.5 0.1)
	(4 3.5 0.2)
	(4 3.5 0.3)
	(4 3.5 0.4)
	(4 3.5 0.5)
	(4 3.5 0.6)
	(4 3.5 0.7)
	(4 3.5 0.8)
	(4 3.5 0.9)
	(4 3.5 1)
	(4.1 3.5 1)
	(4.2 3.5 1)
	(4.3 3.5 1)
	(4.4 3.5 1)
	(4.5 3.5 1)
	(4.6 3.5 1)
	(4.7 3.5 1)
	(4.8 3.5 1)
	(4.9 3.5 1)
	(5 3.5 1)
	(5 3.5 0.9)
	(5 3.5 0.8)
	(5 3.5 0.7)
	(5 3.5 0.6)
	(5 3.5 0.5)
	(5 3.5 0.4)
	(5 3.5 0.3)
	(5 3.5 0.2)
	(5 3.5 0.1)
        );

    }
}



// ************************************************************************* //
